lparkes/netbsd-ZYBO/share/man/man4/man4.hppa/elroy.4
.\"	$NetBSD: elroy.4,v 1.1 2014/02/24 07:23:40 skrll Exp $
.\"	OpenBSD: elroy.4,v 1.2 2007/05/31 19:19:54 jmc Exp
.\"
.\" Copyright (c) 2007 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd February 17, 2017
.Dt ELROY 4 hppa
.Os
.Sh NAME
.Nm elroy
.Nd Elroy PCI hostbridge
.Sh SYNOPSIS
.Cd "elroy* at astro?"
.Cd "pci* at elroy?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Elroy PCI hostbridge and its embedded
I/O SAPIC interrupt controller.
.Sh SEE ALSO
.Xr hppa/astro 4 ,
.Xr hppa/intro 4 ,
.Xr pci 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.2 .
It was ported to
.Nx 6.0
by Nick Hudson.
