lparkes/netbsd-ZYBO/share/man/man4/acpibut.4
.\" $NetBSD: acpibut.4,v 1.3 2008/04/30 13:10:53 martin Exp $
.\"
.\" Copyright (c) 2002, 2004 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 25, 2010
.Dt ACPIBUT 4
.Os
.Sh NAME
.Nm acpibut
.Nd ACPI Button
.Sh SYNOPSIS
.Cd "acpibut* at acpi?"
.Sh DESCRIPTION
The
.Nm
driver supports two kinds of
.Tn ACPI
buttons:
.Bl -column -offset indent "Button         " "/etc/powerd/scripts/power_button"
.It Sy Button Ta Sy Script
.It Li Power Ta Pa /etc/powerd/scripts/power_button
.It Li Sleep Ta Pa /etc/powerd/scripts/sleep_button
.El
.Pp
When a button is pressed, the
.Xr powerd 8
daemon, if running,
will execute the corresponding script.
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr powerd 8
.Sh HISTORY
The
.Nm
driver
appeared in
.Nx 1.6 .
