lparkes/netbsd-ZYBO/share/man/man9/setbit.9
.\" $NetBSD: setbit.9,v 1.2 2010/03/02 06:37:11 jruoho Exp $
.\"
.\" Copyright (c) 2010 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Jukka Ruohonen.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd December 4, 2012
.Dt SETBIT 9
.Os
.Sh NAME
.Nm setbit
.Nd macros related to bitmaps
.Sh SYNOPSIS
.In sys/param.h
.Ft void
.Fn setbit "array" "x"
.Ft void
.Fn clrbit "array" "x"
.Ft int
.Fn isset "array" "x"
.Ft int
.Fn isclr "array" "x"
.Sh DESCRIPTION
The
.Nm
family of macros operate with bitmaps, also known as bit arrays.
.Pp
In a nutshell,
.Fn setbit
sets the bit
.Fa x
in
.Fa array ,
.Fn clrbit
clears it,
.Fn isset
tests whether
.Fa x
is set, and
.Fn isclr
returns 1 if
.Fa x
is not set.
.Sh EXAMPLES
The following example declares a buffer of 10 chars,
treating it as an array of 80 bits:
.Bd -literal -offset indent
char buf[10];

\&...

setbit(buf, 12);	/* set the fifth bit in the second byte */
.Ed
.Sh SEE ALSO
.Xr bitmap 3 ,
.Xr bitstring 3
.Sh CAVEATS
The number of valid bits in a given array is assumed to be multiple of
.Dv CHAR_BIT ,
the number of bits for smallest object that is not a bit-field.
